title: "test rule"
id: 7cff77e1-9663-46a3-8260-17f2e1aa9d0a
related:
    - id: 180c7c5c-d64b-4a63-86e9-68910451bc8b
      type: derived
status: test
description: "this rule is for test purpose"
references:
    - https://twitter.com/notwhickey/status/1333900137232523264
    - https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
author: frack113
date: 2021-11-24
modified: 2023-11-09
tags:
    - tag1
    - tag2
    - tag3
logsource:
    product: windows
    category: dns_query
detection:
    selection1:
        process: "toto"
        file: "tata"
    selection2:
        image:
            - "tutu"
            - "tyty"
    keywords:
        - "titi"
        - "tete"
    condition: selection1 or selection1 or keywords
falsepositives:
    - Unknown
level: medium
